Ran Plan for project: `datadog/dashboard` dir: `datadog/dashboard` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # datadog_dashboard.test_dashboard will be created
+ resource "datadog_dashboard" "test_dashboard" {
      + dashboard_lists_removed = (known after apply)
      + description             = "Created using the Datadog provider in Terraform"
      + id                      = (known after apply)
      + is_read_only            = false
      + layout_type             = "ordered"
      + title                   = "Ordered Layout Dashboard"
      + url                     = (known after apply)

      + template_variable {
          + default = "aws"
          + name    = "var_1"
          + prefix  = "host"
        }
      + template_variable {
          + default = "autoscaling"
          + name    = "var_2"
          + prefix  = "service_name"
        }

      + template_variable_preset {
          + name = "preset_1"

          + template_variable {
              + name  = "var_1"
              + value = "host.dc"
            }
          + template_variable {
              + name  = "var_2"
              + value = "my_service"
            }
        }

      + widget {
          + id = (known after apply)

          + alert_graph_definition {
              + alert_id  = "895605"
              + live_span = "1h"
              + title     = "Widget Title"
              + viz_type  = "timeseries"
            }
        }
      + widget {
          + id = (known after apply)

          + alert_value_definition {
              + alert_id   = "895605"
              + precision  = 3
              + text_align = "center"
              + title      = "Widget Title"
              + unit       = "b"
            }
        }
      + widget {
          + id = (known after apply)

          + alert_value_definition {
              + alert_id   = "895605"
              + precision  = 3
              + text_align = "center"
              + title      = "Widget Title"
              + unit       = "b"
            }
        }
      + widget {
          + id = (known after apply)

          + change_definition {
              + live_span = "1h"
              + title     = "Widget Title"

              + request {
                  + change_type   = "absolute"
                  + compare_to    = "week_before"
                  + increase_good = true
                  + order_by      = "name"
                  + order_dir     = "desc"
                  + q             = "avg:system.load.1{env:staging} by {account}"
                  + show_present  = true
                }
            }
        }
      + widget {
          + id = (known after apply)

          + distribution_definition {
              + live_span = "1h"
              + title     = "Widget Title"

              + request {
                  + q = "avg:system.load.1{env:staging} by {account}"

                  + style {
                      + palette = "warm"
                    }
                }
            }
        }
      + widget {
          + id = (known after apply)

          + check_status_definition {
              + check     = "aws.ecs.agent_connected"
              + group_by  = [
                  + "account",
                  + "cluster",
                ]
              + grouping  = "cluster"
              + live_span = "1h"
              + tags      = [
                  + "account:demo",
                  + "cluster:awseb-ruthebdog-env-8-dn3m6u3gvk",
                ]
              + title     = "Widget Title"
            }
        }
      + widget {
          + id = (known after apply)

          + heatmap_definition {
              + live_span = "1h"
              + title     = "Widget Title"

              + request {
                  + q = "avg:system.load.1{env:staging} by {account}"

                  + style {
                      + palette = "warm"
                    }
                }

              + yaxis {
                  + include_zero = true
                  + max          = "2"
                  + min          = "1"
                  + scale        = "sqrt"
                }
            }
        }
      + widget {
          + id = (known after apply)

          + hostmap_definition {
              + group           = [
                  + "host",
                  + "region",
                ]
              + no_group_hosts  = true
              + no_metric_hosts = true
              + node_type       = "container"
              + scope           = [
                  + "region:us-east-1",
                  + "aws_account:727006795293",
                ]
              + title           = "Widget Title"

              + request {
                  + fill {
                      + q = "avg:system.load.1{*} by {host}"
                    }
                  + size {
                      + q = "avg:memcache.uptime{*} by {host}"
                    }
                }

              + style {
                  + fill_max     = "20"
                  + fill_min     = "10"
                  + palette      = "yellow_to_green"
                  + palette_flip = true
                }
            }
        }
      + widget {
          + id = (known after apply)

          + note_definition {
              + background_color = "pink"
              + content          = "note text"
              + font_size        = "14"
              + has_padding      = true
              + show_tick        = true
              + text_align       = "center"
              + tick_edge        = "left"
              + tick_pos         = "50%"
            }
        }
      + widget {
          + id = (known after apply)

          + query_value_definition {
              + autoscale   = true
              + custom_unit = "xx"
              + live_span   = "1h"
              + precision   = 4
              + text_align  = "right"
              + title       = "Widget Title"

              + request {
                  + aggregator = "sum"
                  + q          = "avg:system.load.1{env:staging} by {account}"

                  + conditional_formats {
                      + comparator = "<"
                      + palette    = "white_on_green"
                      + value      = 2
                    }
                  + conditional_formats {
                      + comparator = ">"
                      + palette    = "white_on_red"
                      + value      = 2.2
                    }
                }
            }
        }
      + widget {
          + id = (known after apply)

          + query_table_definition {
              + live_span = "1h"
              + title     = "Widget Title"

              + request {
                  + aggregator = "sum"
                  + limit      = 10
                  + q          = "avg:system.load.1{env:staging} by {account}"

                  + conditional_formats {
                      + comparator = "<"
                      + palette    = "white_on_green"
                      + value      = 2
                    }
                  + conditional_formats {
                      + comparator = ">"
                      + palette    = "white_on_red"
                      + value      = 2.2
                    }
                }
            }
        }
      + widget {
          + id = (known after apply)

          + scatterplot_definition {
              + color_by_groups = [
                  + "account",
                  + "apm-role-group",
                ]
              + live_span       = "1h"
              + title           = "Widget Title"

              + request {
                  + x {
                      + aggregator = "max"
                      + q          = "avg:system.cpu.user{*} by {service, account}"
                    }
                  + y {
                      + aggregator = "min"
                      + q          = "avg:system.mem.used{*} by {service, account}"
                    }
                }

              + xaxis {
                  + include_zero = true
                  + label        = "x"
                  + max          = "2000"
                  + min          = "1"
                  + scale        = "pow"
                }

              + yaxis {
                  + include_zero = false
                  + label        = "y"
                  + max          = "2222"
                  + min          = "5"
                  + scale        = "log"
                }
            }
        }
      + widget {
          + id = (known after apply)

          + servicemap_definition {
              + filters     = [
                  + "env:prod",
                  + "datacenter:dc1",
                ]
              + service     = "master-db"
              + title       = "env: prod, datacenter:dc1, service: master-db"
              + title_align = "left"
              + title_size  = "16"
            }
        }
      + widget {
          + id = (known after apply)

          + timeseries_definition {
              + legend_size = "2"
              + live_span   = "1h"
              + show_legend = true
              + title       = "Widget Title"

              + event {
                  + q = "sources:test tags:1"
                }
              + event {
                  + q = "sources:test tags:2"
                }

              + marker {
                  + display_type = "error dashed"
                  + label        = " z=6 "
                  + value        = "y = 4"
                }
              + marker {
                  + display_type = "ok solid"
                  + label        = " x=8 "
                  + value        = "10 < y < 999"
                }

              + request {
                  + display_type = "line"
                  + q            = "avg:system.cpu.user{app:general} by {env}"

                  + metadata {
                      + alias_name = "Alpha"
                      + expression = "avg:system.cpu.user{app:general} by {env}"
                    }

                  + style {
                      + line_type  = "dashed"
                      + line_width = "thin"
                      + palette    = "warm"
                    }
                }
              + request {
                  + display_type = "area"

                  + log_query {
                      + index        = "mcnulty"
                      + search_query = "status:info"

                      + compute_query {
                          + aggregation = "avg"
                          + facet       = "@duration"
                          + interval    = 5000
                        }

                      + group_by {
                          + facet = "host"
                          + limit = 10

                          + sort_query {
                              + aggregation = "avg"
                              + facet       = "@duration"
                              + order       = "desc"
                            }
                        }
                    }
                }
              + request {
                  + display_type = "bars"

                  + apm_query {
                      + index        = "apm-search"
                      + search_query = "type:web"

                      + compute_query {
                          + aggregation = "avg"
                          + facet       = "@duration"
                          + interval    = 5000
                        }

                      + group_by {
                          + facet = "resource_name"
                          + limit = 50

                          + sort_query {
                              + aggregation = "avg"
                              + facet       = "@string_query.interval"
                              + order       = "desc"
                            }
                        }
                    }
                }
              + request {
                  + display_type = "area"

                  + process_query {
                      + filter_by = [
                          + "active",
                        ]
                      + limit     = 50
                      + metric    = "process.stat.cpu.total_pct"
                      + search_by = "error"
                    }
                }

              + yaxis {
                  + include_zero = false
                  + max          = "100"
                  + scale        = "log"
                }
            }
        }
      + widget {
          + id = (known after apply)

          + toplist_definition {
              + title = "Widget Title"

              + request {
                  + q = "avg:system.cpu.user{app:general} by {env}"

                  + conditional_formats {
                      + comparator = "<"
                      + palette    = "white_on_green"
                      + value      = 2
                    }
                  + conditional_formats {
                      + comparator = ">"
                      + palette    = "white_on_red"
                      + value      = 2.2
                    }
                }
            }
        }
      + widget {
          + id = (known after apply)

          + group_definition {
              + layout_type = "ordered"
              + show_title  = true
              + title       = "Group Widget"

              + widget {
                  + id = (known after apply)

                  + note_definition {
                      + background_color = "pink"
                      + content          = "cluster note widget"
                      + font_size        = "14"
                      + has_padding      = true
                      + show_tick        = true
                      + text_align       = "center"
                      + tick_edge        = "left"
                      + tick_pos         = "50%"
                    }
                }
              + widget {
                  + id = (known after apply)

                  + alert_graph_definition {
                      + alert_id  = "123"
                      + live_span = "1h"
                      + title     = "Alert Graph"
                      + viz_type  = "toplist"
                    }
                }
            }
        }
      + widget {
          + id = (known after apply)

          + service_level_objective_definition {
              + show_error_budget = true
              + slo_id            = "56789"
              + time_windows      = [
                  + "7d",
                  + "previous_week",
                ]
              + title             = "Widget Title"
              + view_mode         = "overall"
              + view_type         = "detail"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with datadog_dashboard.test_dashboard,
  on test_dashboard.tf line 375, in resource "datadog_dashboard" "test_dashboard":
 375:     default = "aws"

Use `defaults` instead.

(and 7 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p datadog/dashboard`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fdatadog%252Fdashboard%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p datadog/dashboard`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
